Процедура УстановкаПараметровСеанса(ИменаПараметров) Экспорт
	Если ИменаПараметров = Неопределено ИЛИ ИменаПараметров.Найти("ТекущийПользователь") <> Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		ИмяПользователяИБ = ПользовательИБ.Имя;
		СсылкаНаПользователя = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);    
		Если СсылкаНаПользователя.Пустая() Тогда
			СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователяИБ);
		КонецЕсли;
		
		Если СсылкаНаПользователя.Пустая() И ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
			СсылкаНаПользователя = СоздатьПользователяСправочник(ПользовательИБ);
		КонецЕсли;
		ПараметрыСеанса.ТекущийПользователь = СсылкаНаПользователя;
		КонецЕсли;
КонецПроцедуры 

Функция СоздатьПользователяСправочник(ПользовательИБ)
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = ПользовательИБ.Имя;
	НовыйПользователь.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	НовыйПользователь.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйПользователь.Записать();
		Возврат НовыйПользователь.Ссылка;
	Исключение
		ТекстОшибки = "Ошибка автосоздания пользователя в справочнике: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("СЛ.ИнициализацияСеанса", 
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.Пользователи, , 
			ТекстОшибки);
		Возврат Справочники.Пользователи.ПустаяСсылка();	
	 КонецПопытки;
КонецФункции