Процедура Зафиксировать(Событие, Объект = Неопределено, ДопДанные = Неопределено) Экспорт
	Если НЕ МониторингВключен(ПланыВидовХарактеристик.СЛ_НастройкиМониторинга.КонтрольЛимитов) Тогда
        Возврат;
	КонецЕсли;
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия = Новый Структура;
    ПараметрыСобытия.Вставить("Период",      ТекущаяДатаСеанса());
    ТекущийЮзер = Справочники.Пользователи.ПустаяСсылка();
	Попытка
    ТекущийЮзер = ПараметрыСеанса.ТекущийПользователь;
	Исключение
	КонецПопытки;
	ПараметрыСобытия.Вставить("Пользователь", ТекущийЮзер);
    ПараметрыСобытия.Вставить("Событие",     Событие);
    ПараметрыСобытия.Вставить("Объект",      Объект);
    ПараметрыСобытия.Вставить("ИмяКомпьютера", ИмяКомпьютера());
    ПараметрыСобытия.Вставить("НомерСеанса",   НомерСеансаИнформационнойБазы()); 
    
     Если ТипЗнч(ДопДанные) = Тип("Структура") Тогда
        ОписаниеТекст = "";
        Для каждого КлючИЗначение Из ДопДанные Цикл
            ОписаниеТекст = ОписаниеТекст + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение + "; ";
        КонецЦикла;
        ПараметрыСобытия.Вставить("Описание", ОписаниеТекст);   
        ПараметрыСобытия.Вставить("Данные", Новый ХранилищеЗначения(ДопДанные));
    Иначе
        ПараметрыСобытия.Вставить("Описание", Строка(ДопДанные));
   КонецЕсли;
   МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(ПараметрыСобытия);
    ФоновыеЗадания.Выполнить("СЛ_ЛогированиеСервер.ЗаписатьВРегистрФон", МассивПараметров);
КонецПроцедуры    

Процедура ЗаписатьВРегистрФон(Параметры) Экспорт
   МенеджерЗаписи = РегистрыСведений.СЛ_Контроль.СоздатьМенеджерЗаписи();
   ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
   Если Параметры.Свойство("Данные") Тогда
        МенеджерЗаписи.Данные = Параметры.Данные;
    КонецЕсли;
    Попытка
        МенеджерЗаписи.Записать();
    Исключение
        ЗаписьЖурналаРегистрации("СЛ.ЗаписьФон", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

Функция МониторингВключен(ВидСобытия) Экспорт
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ

    |	Регистр.Значение КАК Значение
    |ИЗ
    |	РегистрСведений.СЛ_ХранилищеНастроек КАК Регистр

    |ГДЕ
    |	Регистр.Настройка = &Настройка";
    
    Запрос.УстановитьПараметр("Настройка", ВидСобытия);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Значение;
    КонецЕсли;
    
    Возврат Ложь;
КонецФункции