
&НаКлиенте
Процедура ФильтрУровеньПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСобытиеПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПользовательПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОбъектПриИзменении(Элемент)
	ОбновитьСписокНаСервере(); 
КонецПроцедуры   

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокНаСервере();
	КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокНаСервере()
	СписокСобытий.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ФильтрОбъект) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Объект", Объект.ФильтрОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФильтрПользователь) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Пользователь", Объект.ФильтрПользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФильтрСобытие) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Событие", Объект.ФильтрСобытие);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФильтрУровень) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Уровень", Объект.ФильтрУровень);
	КонецЕсли;
	
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрОбъектЛимитаПриИзменении(Элемент)
		 ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрЛимитЛимитПриИзменении(Элемент)
		 ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрКатегорияЛимитПриИзменении(Элемент)
		ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрСуммаДокументаЛимитПриИзменении(Элемент)
		ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры  

&НаКлиенте
Процедура ОбъектФильтрПревышениеЛимитПриИзменении(Элемент)
	ОбновитьСписокЛимитНаСервере();
КонецПроцедуры
	
	
&НаСервере
Процедура  ОбновитьСписокЛимитНаСервере()
	    СписокЛимитов.Отбор.Элементы.Очистить();
	    Если ЗначениеЗаполнено(Объект.ФильтрОбъектЛимита) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокЛимитов.Отбор, "Объект", Объект.ФильтрОбъектЛимита);
	 КонецЕсли;
	 Если ЗначениеЗаполнено(Объект.ФильтрКатегорияЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокЛимитов.Отбор, "Категория", Объект.ФильтрКатегорияЛимит);
	 КонецЕсли; 
	 Если ЗначениеЗаполнено(Объект.ФильтрЛимитЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
            СписокЛимитов.Отбор, 
            "Лимит", 
            Объект.ФильтрЛимитЛимит, 
            ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	  КонецЕсли;
	   Если ЗначениеЗаполнено(Объект.ФильтрСуммаДокументаЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
            СписокЛимитов.Отбор, 
            "СуммаДокумента", 
            Объект.ФильтрСуммаДокументаЛимит, 
            ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	  КонецЕсли;
	  Если ЗначениеЗаполнено(Объект.ФильтрПревышениеЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
            СписокЛимитов.Отбор, 
            "Превышение", 
            Объект.ФильтрПревышениеЛимит, 
            ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	  КонецЕсли;
КонецПроцедуры

