Процедура ПроверитьЛимитыПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОборотыПоКатегориям");
	ЭлементБлокировки.УстановитьЗначение("Категория",Источник.Категория);
	ЭлементБлокировки.УстановитьЗначение("Пользователь", Источник.Пользователь);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Лимит = ДБ_ОбщегоНазначения.ПолучитьЛимитКатегории(Источник.Категория);
	
	Если Лимит = 0 Тогда
		Возврат;
		КонецЕсли;
		ФактЗаМесяц = ДБ_ОбщегоНазначения.ПолучитьСуммуРасходаЗаМесяц(Источник.Категория, Источник.Пользователь);
		
	ОбщийРасход = ФактЗаМесяц + Источник.Сумма;
	
	Если ОбщийРасход > Лимит Тогда  
		 Превышение = ОбщийРасход - Лимит;
		ПараметрыФона = Новый Структура;
		ПараметрыФона.Вставить("Объект",   Источник.Ссылка);
    		ПараметрыФона.Вставить("Категория", Источник.Категория);
    		ПараметрыФона.Вставить("Лимит",     Лимит);
    		ПараметрыФона.Вставить("СуммаДокумента", Источник.Сумма);
    		ПараметрыФона.Вставить("Превышение", Превышение);
    		ПараметрыФона.Вставить("Пользователь", Источник.Пользователь); 
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрыФона);
		ФоновыеЗадания.Выполнить("СЛ_КонтрольСервер.ЗаписьНарушенияВФоне", МассивПараметров);
			               
		ОстатокДоступно = Лимит - ФактЗаМесяц; 
		Если ОстатокДоступно > 0 Тогда
			ТекстОшибки = СтрШаблон("Превышение лимита по категории '%1'! |Лимит месяца: %2 |Уже потрачено: %3 |Доступно: %4 |Вы пытаетесь провести: %5", 
			Источник.Категория, Лимит, ФактЗаМесяц, ОстатокДоступно, Источник.Сумма);
		Иначе  
			ТекстОшибки = СтрШаблон("Превышение лимита по категории '%1'! |Лимит месяца: %2 |Уже потрачено: %3 |Превышено: %4 |Вы пытаетесь провести: %5", 
			Источник.Категория, Лимит, ФактЗаМесяц, -(ОстатокДоступно), Источник.Сумма); 
		КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Источник.Ссылка, "Сумма",, Отказ);
	ЗаписьЖурналаРегистрации("Контроль.НарушениеЛимита",УровеньЖурналаРегистрации.Предупреждение,, Источник.Ссылка,ТекстОшибки);
	КонецЕсли;
КонецПроцедуры  

Процедура ЗаписьНарушенияВФоне(СтруктураДанных) Экспорт
	   МенеджерЗаписи = РегистрыСведений.НарушениеЛимитов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтруктураДанных);
		Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Контроль.ОшибкаФона",,,,ОписаниеОшибки());
		КонецПопытки;
КонецПроцедуры