//Процедура () Экспорт
//	КонецПроцедуры

Процедура ПриПолученииПриоритетаОбновления() Экспорт
	
КонецПроцедуры    

Процедура ОбработчикиИнициализацииПараметровСеанса() Экспорт
КонецПроцедуры

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса() Экспорт
КонецПроцедуры   

Процедура ПараметрыРаботыКлиентаПриЗапуске() Экспорт
	КонецПроцедуры

Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов() Экспорт
	КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске() Экспорт
	КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиента() Экспорт
	КонецПроцедуры

Процедура ПриДобавленииПереименованийОбъектовМетаданных() Экспорт
	КонецПроцедуры
	
	Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса() Экспорт
	КонецПроцедуры

Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных() Экспорт
	КонецПроцедуры

Процедура ПеренестиНастройкиОбменаДанными() Экспорт
	КонецПроцедуры

Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов() Экспорт
	КонецПроцедуры

Процедура ПриОпределенииНастроекРегламентныхЗаданий() Экспорт
	КонецПроцедуры

Процедура ЗарегистрироватьРегламентноеЗадание() Экспорт
	КонецПроцедуры
