&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
    
    // 1. Запрос к регистру остатков
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ОстаткиДенегОстатки.Пользователь КАК Пользователь,
    |	ОстаткиДенегОстатки.СуммаОстаток КАК Сумма
    |ИЗ
    |	РегистрНакопления.ОстаткиДенег.Остатки КАК ОстаткиДенегОстатки";
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    // 2. Очищаем табличный документ
    Результат.Очистить();
    // 3. Заголовок
    Область = Результат.Область(1, 1);
    Область.Текст = "ОСТАТКИ ДЕНЕГ";
    Область.Шрифт = Новый Шрифт("Arial", 14, Истина); 
    
    // 4. Заголовки колонок
    Область = Результат.Область(3, 1);
    Область.Текст = "Пользователь";
    Область.Шрифт = Новый Шрифт("Arial", 10, Истина);
    
    Область = Результат.Область(3, 3);
    Область.Текст = "Остаток (₽)";
    Область.Шрифт = Новый Шрифт("Arial", 10, Истина);

    
    // 5. Данные
    НомерСтроки = 4;
    Пока Выборка.Следующий() Цикл
        Область = Результат.Область(НомерСтроки, 1);
        Область.Текст = Выборка.Пользователь;
        
        Область = Результат.Область(НомерСтроки, 3);
        Область.Текст = Формат(Выборка.Сумма, "ЧДЦ=2; ЧРД=; ЧН=; ЧГ=0");
         Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	    
        НомерСтроки = НомерСтроки + 1;
    КонецЦикла;
    
    // 6. Итоговая сумма
    ЗапросИтог = Новый Запрос;
    ЗапросИтог.Текст = 
    "ВЫБРАТЬ
    |    СУММА(Остатки.СуммаОстаток) КАК Всего
    |ИЗ
    |    РегистрНакопления.ОстаткиДенег.Остатки КАК Остатки";
    
    РезультатИтог = ЗапросИтог.Выполнить();
    ВыборкаИтог = РезультатИтог.Выбрать();
    ВыборкаИтог.Следующий();
    
    НомерСтроки = НомерСтроки + 1;
    Область = Результат.Область(НомерСтроки, 1);
    Область.Текст = "ОБЩИЙ ОСТАТОК:";
    Область.Шрифт = Новый Шрифт("Arial", 10, Истина);
    
    Область = Результат.Область(НомерСтроки, 3);
    Область.Текст = Формат(ВыборкаИтог.Всего, "ЧДЦ=2; ЧРД=; ЧН=; ЧГ=0");
    Область.Шрифт = Новый Шрифт("Arial", 10, Истина);
     Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	
	Возврат Результат;
Конецфункции     

&НаКлиенте
Процедура СформироватьНаКлиенте()
    
    // Вызываем серверную функцию
    ТабДок = СформироватьНаСервере();
    
    // Показываем результат на клиенте
    Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
        ТабДок.Показать();
    КонецЕсли;
    
КонецПроцедуры