Функция ПолучитьЛимитКатегории(СсылкаНаКатегорию) Экспорт
	Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
		Возврат 0;
	КонецЕсли;
	
	Лимит = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаКатегорию, "Лимит");
	
	Если (Лимит = 0 Или Лимит = Неопределено) Тогда
		Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаКатегорию, "Родитель");
		
		Если ЗначениеЗаполнено(Родитель) Тогда
			Лимит = ПолучитьЛимитКатегории(Родитель);
		КонецЕсли;
		КонецЕсли;
		
		Возврат ?(Лимит < 0, 0, Лимит);
КонецФункции  

Функция ПолучитьСуммуРасходаЗаМесяц(СсылкаНаКатегорию, СсылкаНаПользователя)Экспорт 
	   Запрос = Новый Запрос;
	   Запрос.Текст=
	   "ВЫБРАТЬ
	   |	ЕСТЬNULL(Обороты.СуммаРасход,0) КАК Сумма
	   |ИЗ
	   |	РегистрНакопления.ОборотыПоКатегориям.Обороты(&Начало, &Конец,, Категория = &Категория И Пользователь = &Пользователь ) КАК Обороты";
	   Запрос.УстановитьПараметр("Начало", НачалоМесяца(ТекущаяДата()));
	   Запрос.УстановитьПараметр("Конец", КонецМесяца(ТекущаяДата()));
	   Запрос.УстановитьПараметр("Пользователь", СсылкаНаПользователя);
	   Запрос.УстановитьПараметр("Категория", СсылкаНаКатегорию);
	   Выборка = Запрос.Выполнить().Выбрать();
	   
	   Возврат ?(Выборка.Следующий(), Выборка.Сумма, 0);
КонецФункции

