

&НаКлиенте
Процедура Загрузить(Команда)
    // Проверка заполнения даты перед запуском
    Если Не ЗначениеЗаполнено(Объект.ДатаКурса) Тогда
        Сообщить("Выберите дату курса!");
        Возврат;
    КонецЕсли;
    
    ЗагрузитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервере()
        ВыгрузкаИзЦБКурса.ЗагрузкаКурсаВалютРегл();
	   ЗаполнитьТаблицуНаСервере();
	КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
    
    Объект.Результат.Очистить();
    Таб = Объект.Результат;
           
    Таб.Область(1, 1).Текст = "Курсы в базе на " + Формат(Объект.ДатаКурса, "ДФ=dd.MM.yyyy");
    Таб.Область(2, 1).Текст = "Валюта"; 
    Таб.Область(2, 2).Текст = "Курс"; 
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ

    |	КурсыВалют.Валюта.Наименование КАК ВалютаНаименование,
    |	КурсыВалют.Курс КАК Курс
    |ИЗ
    |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалют";
    
    Запрос.УстановитьПараметр("ДатаКурса", Объект.ДатаКурса);
    Выборка = Запрос.Выполнить().Выбрать();
    
    Счетчик = 3;
    Пока Выборка.Следующий() Цикл
        
        Таб.Область(Счетчик, 1).Текст = Выборка.ВалютаНаименование;
        Таб.Область(Счетчик, 2).Текст = Формат(Выборка.Курс, "ЧДЦ=4; ЧРД=.");
        
        Счетчик = Счетчик + 1;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   Объект.ДатаКурса = ТекущаяДата();
	    ЗагрузитьНаСервере();
КонецПроцедуры
