Процедура СинхронизироватьСПользователем(ОбъектСправочника, Отказ) Экспорт
	  
   Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		
		ПользовательИБ = Неопределено;
		Если ЗначениеЗаполнено(ОбъектСправочника.ИдентификаторПользователяИБ) Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ОбъектСправочника.ИдентификаторПользователяИБ);
		КонецЕсли;
		
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ОбъектСправочника.Наименование);
		КонецЕсли;
		
		
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		КонецЕсли;
		
		
		ПользовательИБ.Имя = ОбъектСправочника.Наименование;
		ПользовательИБ.ПолноеИмя = ОбъектСправочника.Наименование;
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.Пароль = ОбъектСправочника.Пароль;
		ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
		
		ПользовательИБ.Роли.Очистить();
		БазоваяРоль = Метаданные.Роли.Найти("БазовыеПрава");
		Если БазоваяРоль <> Неопределено Тогда
			ПользовательИБ.Роли.Добавить(БазоваяРоль);
		КонецЕсли; 
		
		Для Каждого СтрРоль Из ОбъектСправочника.Роли Цикл
   		 НайденнаяРоль = Метаданные.Роли.Найти(СтрРоль.ИмяРоли);
    			Если НайденнаяРоль <> Неопределено Тогда
       			 ПользовательИБ.Роли.Добавить(НайденнаяРоль);
   			 КонецЕсли;
		КонецЦикла;
		
		
		ПользовательИБ.Записать();
		
		ОбъектСправочника.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
		ПараметрыЛога = Новый Структура("Действие, Результат", "Синхронизация", "Успешно");
		СЛ_ЛогированиеСервер.Зафиксировать("УправлениеПользователями", ОбъектСправочника.Ссылка, ПараметрыЛога);
	     Сообщить("ID созданного пользователя: " + ОбъектСправочника.ИдентификаторПользователяИБ);
	Исключение  
		ПолныйТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	    СЛ_ЛогированиеСервер.Зафиксировать("ОшибкаСинхронизацииПользователя", ОбъектСправочника.Ссылка, ОписаниеОшибки());
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось синхронизировать пользователя: " + ПолныйТекстОшибки);
    КонецПопытки;
КонецПроцедуры 

