Процедура  СоздатьИПровестиЕжедневныйДокумент() Экспорт
	НовыйДок = Документы.ИзменениеСтоимостиАктива.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Актив = Справочники.Активы.НайтиПоНаименованию("Т-банк инвестокопилка");
	ЗаполнитьПоАктиву.ЗаполнитьПоАктиву(НовыйДок);
	НовыйДок.ТипИзменения = Перечисления.ТипОперацииАктивов.Пополнение;
	НовыйДок.НоваяЦена = НовыйДок.ТекущаяСтоимость + 300;
	Попытка 
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		ЗаписьЖурналаРегистрации("ЕжедневноеСозданиеДокумента", УровеньЖурналаРегистрации.Информация,,, "Документ создан успешно:"  + НовыйДок.Ссылка);
	Исключение
		ЗаписьЖурналаРегистрации("ЕжедневноеСозданиеДокумента", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
	КонецПроцедуры
